Hjemmeside_pro_B_2022-2024.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="da" xml:lang="da">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Programmering B 2022 - 2024</title>
<meta name="author" content="Jacob Debel" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Programmering B 2022 - 2024
<br />
<span class="subtitle">Vibenshus Gymnasium</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Indhold</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcb603b6">Lektionsbeskrivelser</a>
<ul>
<li><a href="#org5daad85"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-08-11 tor&gt;</span></span></a></li>
<li><a href="#orge3f66af"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-08-08 man&gt;</span></span></a></li>
</ul>
</li>
<li><a href="#org43d0fbd">Præsentationer</a>
<ul>
<li><a href="#orgd5314f3">Git</a></li>
<li><a href="#orgf3d5ffd">Introduktion til faget</a></li>
</ul>
</li>
<li><a href="#org3221db7">Opgaver</a>
<ul>
<li><a href="#org47cfb5e">Logbog</a></li>
</ul>
</li>
<li><a href="#orgc7fa988">UVB</a>
<ul>
<li><a href="#orgf187637">Git</a></li>
<li><a href="#org3cebd49">Grundlæggende programmering med <code>python arcade</code></a></li>
<li><a href="#org0e327bb">Udvikling af GUIs med <code>pyside6</code></a></li>
<li><a href="#org4440d2c">Kryptografi</a></li>
<li><a href="#org1f39621">Robotstyring - Lego Mindstorms</a></li>
<li><a href="#org365092e">Machine Learning</a></li>
</ul>
</li>
<li><a href="#orga80b090">Om</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcb603b6" class="outline-2">
<h2 id="orgcb603b6">Lektionsbeskrivelser</h2>
<div class="outline-text-2" id="text-orgcb603b6">
</div>
<div id="outline-container-org5daad85" class="outline-3">
<h3 id="org5daad85"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-08-11 tor&gt;</span></span></h3>
<div class="outline-text-3" id="text-org5daad85">
<p>
<b>Dagens lektie</b>
</p>

<p>
Alle skal gerne have installeret <code>git</code>, <code>python</code> og en editor/et IDE (vælg pycharm, hvis I er i tvivl. <a href="https://vibenshus-gymnasium-programmering.github.io/Introduktion/">Se præsentationen fra sidste gang</a> for en vejledning til installation af programmerne.)
</p>

<p>
<b>Dagens program</b>
</p>

<p>
Vi skal i dag arbejde med brugen af <code>git</code> og vi tager udgangspunkt i præsentationen om netop <code>git</code> <a href="https://vibenshus-gymnasium-programmering.github.io/Git_praesentation/">her</a>. I kan også finde linket til præsentationen under fanen Præsentationer her på siden.
</p>
</div>
</div>


<div id="outline-container-orge3f66af" class="outline-3">
<h3 id="orge3f66af"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-08-08 man&gt;</span></span></h3>
<div class="outline-text-3" id="text-orge3f66af">
<p>
I dag står den på introduktion til faget programmering B. I kan finde den tilhørende præsentationer under fanen Præsentationer her på siden.
</p>

<p>
Efter selve introduktionen til faget går vi så småt i gang med at installere det programmel (det danske ord for software), som vi skal bruge.
</p>

<p>
<a href="https://vibenshus-gymnasium-programmering.github.io/Introduktion/">https://vibenshus-gymnasium-programmering.github.io/Introduktion/</a>
</p>

<p>
<b>Post Scriptum</b>
Så er vi ligesom i gang. Det var dejligt at lære jer at kende. Det skal nok blive et rigtig godt år!
</p>
</div>
</div>
</div>
<div id="outline-container-org43d0fbd" class="outline-2">
<h2 id="org43d0fbd">Præsentationer</h2>
<div class="outline-text-2" id="text-org43d0fbd">
</div>
<div id="outline-container-orgd5314f3" class="outline-3">
<h3 id="orgd5314f3">Git</h3>
<div class="outline-text-3" id="text-orgd5314f3">
<p>
Her er præsentationen til opsætning af og opgaverne om <code>git</code>.
</p>

<p>
<a href="https://vibenshus-gymnasium-programmering.github.io/Git_praesentation/">https://vibenshus-gymnasium-programmering.github.io/Git_praesentation/</a>
</p>
</div>
</div>

<div id="outline-container-orgf3d5ffd" class="outline-3">
<h3 id="orgf3d5ffd">Introduktion til faget</h3>
<div class="outline-text-3" id="text-orgf3d5ffd">
<p>
Her er præsentationen til faget. Åbn linket i en anden tab/et andet vindue.
</p>

<p>
<a href="https://vibenshus-gymnasium-programmering.github.io/Introduktion/">https://vibenshus-gymnasium-programmering.github.io/Introduktion/</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org3221db7" class="outline-2">
<h2 id="org3221db7">Opgaver</h2>
<div class="outline-text-2" id="text-org3221db7">
</div>
<div id="outline-container-org47cfb5e" class="outline-3">
<h3 id="org47cfb5e">Logbog</h3>
<div class="outline-text-3" id="text-org47cfb5e">
<p>
Opret jeres logbog ved at følge linket her: <a href="https://classroom.github.com/a/slPR9059">https://classroom.github.com/a/slPR9059</a>
</p>

<p>
Sørg for at føre logbog hver uge. Der bliver holdt øje med jer. :)
</p>
</div>
</div>
</div>

<div id="outline-container-orgc7fa988" class="outline-2">
<h2 id="orgc7fa988">UVB</h2>
<div class="outline-text-2" id="text-orgc7fa988">
</div>
<div id="outline-container-orgf187637" class="outline-3">
<h3 id="orgf187637">Git</h3>
</div>
<div id="outline-container-org3cebd49" class="outline-3">
<h3 id="org3cebd49">Grundlæggende programmering med <code>python arcade</code></h3>
</div>
<div id="outline-container-org0e327bb" class="outline-3">
<h3 id="org0e327bb">Udvikling af GUIs med <code>pyside6</code></h3>
</div>
<div id="outline-container-org4440d2c" class="outline-3">
<h3 id="org4440d2c">Kryptografi</h3>
</div>
<div id="outline-container-org1f39621" class="outline-3">
<h3 id="org1f39621">Robotstyring - Lego Mindstorms</h3>
</div>
<div id="outline-container-org365092e" class="outline-3">
<h3 id="org365092e">Machine Learning</h3>
</div>
</div>
<div id="outline-container-orga80b090" class="outline-2">
<h2 id="orga80b090">Om</h2>
<div class="outline-text-2" id="text-orga80b090">
<p>
Dette er en simpel hjemmeside knyttet til programmering B på Vibenshus Gymnasium for skoleårene 2022-2024.
</p>

<p>
Faktisk er der blot tale om en simpel org-mode-fil, som er eksporteret til html og css vha. <a href="https://github.com/fniessen/org-html-themes">https://github.com/fniessen/org-html-themes</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Dato: 2022-2024</p>
<p class="author">Forfatter: Jacob Debel</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
